Revit 2026 API

# SpaceActualHVACLoad Property

---

Get the Actual HVAC Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ActualHVACLoad { get; }
```
```vb
Public ReadOnly Property ActualHVACLoad As Double
	Get
```
```cpp
public:
property double ActualHVACLoad {
	double get ();
}
```
```fsharp
member ActualHVACLoad : float with get
```

#### Property Value

Double

This property is used to get the Actual HVAC Load (Unit: W) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace